# -*- coding:utf-8 -*
module Faker
  module Japanese
    module Address
      extend self

      @prefs = [
	['北海道',   'ほっかいどう', '01', '北海道'],
	['青森県',   'あおもりけん', '02', '東北'],
	['岩手県',   'いわてけん',   '03', '東北'],
	['宮城県',   'みやぎけん',   '04', '東北'],
	['秋田県',   'あきたけん',   '05', '東北'],
	['山形県',   'やまがたけん', '06', '東北'],
	['福島県',   'ふくしまけん', '07', '東北'],
	['茨城県',   'いばらきけん', '08', '関東'],
	['栃木県',   'とちぎけん',   '09', '関東'],
	['群馬県',   'ぐんまけん',   '10', '関東'],
	['埼玉県',   'さいたまけん', '11', '関東'],
	['千葉県',   'ちばけん',     '12', '関東'],
	['東京都',   'とうきょうと', '13', '関東'],
	['神奈川県', 'かながわけん', '14', '関東'],
	['新潟県',   'にいがたけん', '15', '中部'],
	['富山県',   'とやまけん',   '16', '中部'],
	['石川県',   'いしかわけん', '17', '中部'],
	['福井県',   'ふくいけん',   '18', '中部'],
	['山梨県',   'やまなしけん', '19', '中部'],
	['長野県',   'ながのけん',   '20', '中部'],
	['岐阜県',   'ぎふけん',     '21', '中部'],
	['静岡県',   'しずおかけん', '22', '中部'],
	['愛知県',   'あいちけん',   '23', '中部'],
	['三重県',   'みえけん',     '24', '近畿'],
	['滋賀県',   'しがけん',     '25', '近畿'],
	['京都府',   'きょうとふ',   '26', '近畿'],
	['大阪府',   'おおさかふ',   '27', '近畿'],
	['兵庫県',   'ひょうごけん', '28', '近畿'],
	['奈良県',   'ならけん',     '29', '近畿'],
	['和歌山県', 'わかやまけん', '30', '近畿'],
	['鳥取県',   'とっとりけん', '31', '中国'],
	['島根県',   'しまねけん',   '32', '中国'],
	['岡山県',   'おかやまけん', '33', '中国'],
	['広島県',   'ひろしまけん', '34', '中国'],
	['山口県',   'やまぐちけん', '35', '中国'],
	['徳島県',   'とくしまけん', '36', '四国'],
	['香川県',   'かがわけん',   '37', '四国'],
	['愛媛県',   'えひめけん',   '38', '四国'],
	['高知県',   'こうちけん',   '39', '四国'],
	['福岡県',   'ふくおかけん', '40', '九州'],
	['佐賀県',   'さがけん',     '41', '九州'],
	['長崎県',   'ながさきけん', '42', '九州'],
	['熊本県',   'くまもとけん', '43', '九州'],
	['大分県',   'おおいたけん', '44', '九州'],
	['宮崎県',   'みやざきけん', '45', '九州'],
	['鹿児島県', 'かごしまけん', '46', '九州'],
	['沖縄県',   'おきなわけん', '47', '沖縄'],
      ]

      def pref
	chosen = rand(@prefs)
	pref = chosen[0]
	set_yomi(pref, chosen[1])
	pref
      end

      def set_yomi(pref, yomi)
        pref.instance_variable_set('@yomi', yomi)
        def pref.yomi; @yomi end
      end

      def rand(array)
	array[Kernel.rand(array.size)]
      end
    end
  end
end
